levizh/zephyr/ext/hal/xhsc/hc32_ddl/hc32f460/drivers/src/hc32m120_ll_interrupts_share.c
    /* TimerA overflow */
    if (1UL == bCM_TMRA->BCSTRH_b.ITENOVF) {
        u32Tmp1 = bCM_TMRA->BCSTRH_b.OVFF;
        if ((0UL != (ISELBR28 & BIT_MASK_01)) && (0UL != u32Tmp1)) {
            TMRA_Ovf_IrqHandler();
        }
    }
    /* TimerA underflow */
    if (1UL == bCM_TMRA->BCSTRH_b.ITENUDF) {
        u32Tmp1 = bCM_TMRA->BCSTRH_b.UDFF;
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL2) && (0UL != u32Tmp1)) {
            TMRA_Udf_IrqHandler();
        }
    }
    /* TimerA compare match */
    if (0UL != (CM_TMRA->ICONR & (uint32_t)(TMRA_ICONR_ITEN1 | TMRA_ICONR_ITEN2))) {
        u32Tmp1 = CM_TMRA->STFLR & (uint32_t)(TMRA_STFLR_CMPF1 | TMRA_STFLR_CMPF2);
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL3) && (0UL != u32Tmp1)) {
            TMRA_Cmp_IrqHandler();
        }
    }
    /* Timer4 overflow */
    if (1UL == bCM_TMR4->CCSR_b.IRQPEN) {
        u32Tmp1 = bCM_TMR4->CCSR_b.IRQPF;
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL4) && (0UL != u32Tmp1)) {
            TMR4_Ovf_IrqHandler();
        }
    }
    /* Timer4 underflow */
    if (1UL == bCM_TMR4->CCSR_b.IRQZEN) {
        u32Tmp1 = bCM_TMR4->CCSR_b.IRQZF;
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL5) && (0UL != u32Tmp1)) {
            TMR4_Udf_IrqHandler();
        }
    }
    /* TimerB3 overflow */
    if (1UL == bCM_TMRB_3->BCSTRH_b.ITENOVF) {
        u32Tmp1 = bCM_TMRB_3->BCSTRH_b.OVFF;
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL8) && (0UL != u32Tmp1)) {
            TMRB_3_Ovf_IrqHandler();
        }
    }
    /* TimerB3 underflow */
    if (1UL == bCM_TMRB_3->BCSTRH_b.ITENUDF) {
        u32Tmp1 = bCM_TMRB_3->BCSTRH_b.UDFF;
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL9) && (0UL != u32Tmp1)) {
            TMRB_3_Udf_IrqHandler();
        }
    }
    /* TimerB4 compare match */
    if (1UL == bCM_TMRB_4->ICONR_b.ITEN1) {
        u32Tmp1 = bCM_TMRB_4->STFLR_b.CMPF1;
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL10) && (0UL != u32Tmp1)) {
            TMRB_4_Cmp_IrqHandler();
        }
    }
    /* ADC seq.A convert complete */
    if (1UL == bCM_ADC->ICR_b.EOCAIEN) {
        u32Tmp1 = bCM_ADC->ISR_b.EOCAF;
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL11) && (0UL != u32Tmp1)) {
            ADC_SeqA_IrqHandler();
        }
    }
    /* USART2 Rx ORE/FE/PE error */
    if (1UL == bCM_USART2->CR1_b.RIE) {
        u32Tmp1 = CM_USART2->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL12) && (0UL != u32Tmp1)) {
            USART2_RxError_IrqHandler();
        }
    }
    /* USART3 Tx buffer empty */
    if (1UL == bCM_USART3->CR1_b.TXEIE) {
        u32Tmp1 = bCM_USART3->SR_b.TXE;
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL13) && (0UL != u32Tmp1)) {
            USART3_TxEmpty_IrqHandler();
        }
    }
    /* I2c Tx end */
    if (1UL == bCM_I2C->CR2_b.TENDIE) {
        u32Tmp1 = bCM_I2C->SR_b.TENDF;
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL14) && (0UL != u32Tmp1)) {
            I2C_TxComplete_IrqHandler();
        }
    }
    /* SPI bus idle */
    if (1UL == bCM_SPI->CR1_b.IDIE) {
        u32Tmp1 = bCM_SPI->SR_b.IDLNF;
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL15) && (0UL == u32Tmp1)) {
            SPI_Idle_IrqHandler();
        }
    }
}

/**
 * @brief  Interrupt No.029 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ029_Handler(void)
{
    uint32_t u32Tmp1;
    /* Timer2 compare match */
    if (1UL == bCM_TMR2->ICONR_b.CMENA) {
        u32Tmp1 = bCM_TMR2->STFLR_b.CMFA;
        if ((1UL == bCM_INTC->ISELBR29_b.ISEL2) && (0UL != u32Tmp1)) {
            TMR2_Cmp_IrqHandler();
        }
    }
    /* Timer2 overflow */
    if (1UL == bCM_TMR2->ICONR_b.OVENA) {
        u32Tmp1 = bCM_TMR2->STFLR_b.OVFA;
        if ((1UL == bCM_INTC->ISELBR29_b.ISEL3) && (0UL != u32Tmp1)) {
            TMR2_Ovf_IrqHandler();
        }
    }
    /* TimerB4 overflow */
    if (1UL == bCM_TMRB_4->BCSTRH_b.ITENOVF) {
        u32Tmp1 = bCM_TMRB_4->BCSTRH_b.OVFF;
        if ((1UL == bCM_INTC->ISELBR29_b.ISEL8) && (0UL != u32Tmp1)) {
            TMRB_4_Ovf_IrqHandler();
        }
    }
    /* TimerB4 underflow */
    if (1UL == bCM_TMRB_4->BCSTRH_b.ITENUDF) {
        u32Tmp1 = bCM_TMRB_4->BCSTRH_b.UDFF;
        if ((1UL == bCM_INTC->ISELBR29_b.ISEL9) && (0UL != u32Tmp1)) {
            TMRB_4_Udf_IrqHandler();
        }
    }
    /* TimerB3 compare match */
    if (1UL == bCM_TMRB_3->ICONR_b.ITEN1) {
        u32Tmp1 = bCM_TMRB_3->STFLR_b.CMPF1;
        if ((1UL == bCM_INTC->ISELBR29_b.ISEL10) && (0UL != u32Tmp1)) {
            TMRB_3_Cmp_IrqHandler();
        }
    }
    /* ADC seq.B convert complete */
    if (1UL == bCM_ADC->ICR_b.EOCBIEN) {
        u32Tmp1 = bCM_ADC->ISR_b.EOCBF;
        if ((1UL == bCM_INTC->ISELBR29_b.ISEL11) && (0UL != u32Tmp1)) {
            ADC_SeqB_IrqHandler();
        }
    }
    /* USART2 Rx end */
    if (1UL == bCM_USART2->CR1_b.RIE) {
        u32Tmp1 = bCM_USART2->SR_b.RXNE;
        if ((1UL == bCM_INTC->ISELBR29_b.ISEL12) && (0UL != u32Tmp1)) {
            USART2_RxFull_IrqHandler();
        }
    }
    /* USART3 Tx end */
    if (1UL == bCM_USART3->CR1_b.TCIE) {
        u32Tmp1 = bCM_USART3->SR_b.TC;
        if ((1UL == bCM_INTC->ISELBR29_b.ISEL13) && (0UL != u32Tmp1)) {
            USART3_TxComplete_IrqHandler();
        }
    }
    /* I2c Rx end */
    if (1UL == bCM_I2C->CR2_b.RFULLIE) {
        u32Tmp1 = bCM_I2C->SR_b.RFULLF;
        if ((1UL == bCM_INTC->ISELBR29_b.ISEL14) && (0UL != u32Tmp1)) {
            I2C_RxFull_IrqHandler();
        }
    }
}

/**
 * @brief  Interrupt No.030 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ030_Handler(void)
{
    uint32_t u32Tmp1;
    /* TimerB1 overflow */
    if (1UL == bCM_TMRB_1->BCSTRH_b.ITENOVF) {
        u32Tmp1 = bCM_TMRB_1->BCSTRH_b.OVFF;
        if ((1UL == bCM_INTC->ISELBR30_b.ISEL8) && (0UL != u32Tmp1)) {
            TMRB_1_Ovf_IrqHandler();
        }
    }
    /* TimerB1 underflow */
    if (1UL == bCM_TMRB_1->BCSTRH_b.ITENUDF) {
        u32Tmp1 = bCM_TMRB_1->BCSTRH_b.UDFF;
        if ((1UL == bCM_INTC->ISELBR30_b.ISEL9) && (0UL != u32Tmp1)) {
            TMRB_1_Udf_IrqHandler();
        }
    }
    /* TimerB2 compare match */
    if (1UL == bCM_TMRB_2->ICONR_b.ITEN1) {
        u32Tmp1 = bCM_TMRB_2->STFLR_b.CMPF1;
        if ((1UL == bCM_INTC->ISELBR30_b.ISEL10) && (0UL != u32Tmp1)) {
            TMRB_2_Cmp_IrqHandler();
        }
    }
    /* ADC convert result in range of window 0 setting */
    if (1UL == bCM_ADC->AWDCR_b.AWD0IEN) {
        u32Tmp1 = bCM_ADC->AWDSR_b.AWD0F;
        if ((1UL == bCM_INTC->ISELBR30_b.ISEL11) && (0UL != u32Tmp1)) {
            ADC_Cmp0_IrqHandler();
        }
    }
    /* USART2 Tx buffer empty */
    if (1UL == bCM_USART2->CR1_b.TXEIE) {
        u32Tmp1 = bCM_USART2->SR_b.TXE;
        if ((1UL == bCM_INTC->ISELBR30_b.ISEL12) && (0UL != u32Tmp1)) {
            USART2_TxEmpty_IrqHandler();
        }
    }
    /* I2c Tx buffer empty */
    if (1UL == bCM_I2C->CR2_b.TEMPTYIE) {
        u32Tmp1 = bCM_I2C->SR_b.TEMPTYF;
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL14) && (0UL != u32Tmp1)) {
            I2C_TxEmpty_IrqHandler();
        }
    }
}

/**
 * @brief  Interrupt No.031 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ031_Handler(void)
{
    uint32_t u32Tmp1;
    uint32_t u32Tmp2;
    /* LVD detected */
    if (0UL == bCM_EFM->LVDICGCR_b.LVDDIS) {
        u32Tmp1 = bCM_PWC->LVDCSR_b.DETF;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL2) && (0UL != u32Tmp1)) {
            PWC_LVD_IrqHandler();
        }
    }
    /* EFM operate end */
    if (1UL == bCM_EFM->FITE_b.OPTENDITE) {
        u32Tmp1 = bCM_EFM->FSR_b.OPTEND;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL4) && (0UL != u32Tmp1)) {
            EFM_OpEnd_IrqHandler();
        }
    }
    /* TimerB2 overflow */
    if (1UL == bCM_TMRB_2->BCSTRH_b.ITENOVF) {
        u32Tmp1 = bCM_TMRB_2->BCSTRH_b.OVFF;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL8) && (0UL != u32Tmp1)) {
            TMRB_2_Ovf_IrqHandler();
        }
    }
    /* TimerB2 underflow */
    if (1UL == bCM_TMRB_2->BCSTRH_b.ITENUDF) {
        u32Tmp1 = bCM_TMRB_2->BCSTRH_b.UDFF;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL9) && (0UL != u32Tmp1)) {
            TMRB_2_Udf_IrqHandler();
        }
    }
    /* TimerB1 compare match */
    if (1UL == bCM_TMRB_1->ICONR_b.ITEN1) {
        u32Tmp1 = bCM_TMRB_1->STFLR_b.CMPF1;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL10) && (0UL != u32Tmp1)) {
            TMRB_1_Cmp_IrqHandler();
        }
    }
    if (1UL == bCM_ADC->AWDCR_b.AWD1IEN) {
        /* ADC convert result in range of window 1 if independence use */
        u32Tmp1 = bCM_ADC->AWDSR_b.AWD1F;
        u32Tmp2 = (uint32_t)CM_ADC->AWDCR & (uint32_t)ADC_AWDCR_AWDCM;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL11) && (0UL != u32Tmp1) && (0UL == u32Tmp2)) {
            ADC_Cmp1_IrqHandler();
        }
        /* ADC convert result combination use of window 0 & 1 */
        u32Tmp1 = bCM_ADC->AWDSR_b.AWDCMF;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL11) && (0UL != u32Tmp1) && (0UL != u32Tmp2)) {
            ADC_Cmp1_IrqHandler();
        }
    }
    /* USART2 Tx end */
    if (1UL == bCM_USART2->CR1_b.TCIE) {
        u32Tmp1 = bCM_USART2->SR_b.TC;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL12) && (0UL != u32Tmp1)) {
            USART2_TxComplete_IrqHandler();
        }
    }
    /* SPI Tx buffer empty */
    if (1UL == bCM_SPI->CR1_b.TXIE) {
        u32Tmp1 = bCM_SPI->SR_b.TDEF;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL13) && (0UL != u32Tmp1)) {
            SPI_TxEmpty_IrqHandler();
        }
    }
}

/**
 * @}
 */

/**
 * @defgroup Share_Interrupts_Weakdef_Prototypes Share Interrupts weak function prototypes
 * @{
 */
__WEAKDEF void EXTINT08_IrqHandler(void)
{
}
__WEAKDEF void EXTINT09_IrqHandler(void)
{
}
__WEAKDEF void DMA_TC0_IrqHandler(void)
{
}
__WEAKDEF void DMA_BTC0_IrqHandler(void)
{
}
__WEAKDEF void DMA_TC1_IrqHandler(void)
{
}
__WEAKDEF void DMA_BTC1_IrqHandler(void)
{
}
__WEAKDEF void DMA_Error_IrqHandler(void)
{
}
__WEAKDEF void EFM_ProgramEraseError_IrqHandler(void)
{
}
__WEAKDEF void EFM_ColError_IrqHandler(void)
{
}
__WEAKDEF void EFM_OpEnd_IrqHandler(void)
{
}
__WEAKDEF void CLK_XtalStop_IrqHandler(void)
{
}
__WEAKDEF void SWDT_IrqHandler(void)
{
}
__WEAKDEF void TMR2_Cmp_IrqHandler(void)
{
}
__WEAKDEF void TMR2_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMR4_GCmpUH_IrqHandler(void)
{
}
__WEAKDEF void TMR4_GCmpUL_IrqHandler(void)
{
}
__WEAKDEF void TMR4_GCmpVH_IrqHandler(void)
{
}
__WEAKDEF void TMR4_GCmpVL_IrqHandler(void)
{
}
__WEAKDEF void TMR4_GCmpWH_IrqHandler(void)
{
}
__WEAKDEF void TMR4_GCmpWL_IrqHandler(void)
{
}
__WEAKDEF void TMR4_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMR4_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMR4_ReloadU_IrqHandler(void)
{
}
__WEAKDEF void TMR4_ReloadV_IrqHandler(void)
{
}
__WEAKDEF void TMR4_ReloadW_IrqHandler(void)
{
}
__WEAKDEF void EMB_IrqHandler(void)
{
}
__WEAKDEF void TMRA_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMRA_Cmp_IrqHandler(void)
{
}
__WEAKDEF void TMRB_1_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMRB_1_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMRB_1_Cmp_IrqHandler(void)
{
}
__WEAKDEF void TMRB_2_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMRB_2_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMRB_2_Cmp_IrqHandler(void)
{
}
__WEAKDEF void TMRB_3_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMRB_3_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMRB_3_Cmp_IrqHandler(void)
{
}
__WEAKDEF void TMRB_4_Ovf_IrqHandler(void)
{
}
__WEAKDEF void TMRB_4_Udf_IrqHandler(void)
{
}
__WEAKDEF void TMRB_4_Cmp_IrqHandler(void)
{
}
__WEAKDEF void USART1_RxError_IrqHandler(void)
{
}
__WEAKDEF void USART1_RxFull_IrqHandler(void)
{
}
__WEAKDEF void USART1_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void USART1_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void USART2_RxError_IrqHandler(void)
{
}
__WEAKDEF void USART2_RxFull_IrqHandler(void)
{
}
__WEAKDEF void USART2_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void USART2_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void USART3_RxError_IrqHandler(void)
{
}
__WEAKDEF void USART3_RxFull_IrqHandler(void)
{
}
__WEAKDEF void USART3_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void USART3_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void I2C_RxFull_IrqHandler(void)
{
}
__WEAKDEF void I2C_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void I2C_TxComplete_IrqHandler(void)
{
}
__WEAKDEF void I2C_EE_IrqHandler(void)
{
}
__WEAKDEF void SPI_RxFull_IrqHandler(void)
{
}
__WEAKDEF void SPI_TxEmpty_IrqHandler(void)
{
}
__WEAKDEF void SPI_Idle_IrqHandler(void)
{
}
__WEAKDEF void SPI_Error_IrqHandler(void)
{
}
__WEAKDEF void CTC_IrqHandler(void)
{
}
__WEAKDEF void EKEY_IrqHandler(void)
{
}
__WEAKDEF void TMR0_CmpA_IrqHandler(void)
{
}
__WEAKDEF void ADC_SeqA_IrqHandler(void)
{
}
__WEAKDEF void ADC_SeqB_IrqHandler(void)
{
}
__WEAKDEF void ADC_Cmp0_IrqHandler(void)
{
}
__WEAKDEF void ADC_Cmp1_IrqHandler(void)
{
}
__WEAKDEF void PWC_LVD_IrqHandler(void)
{
}
/**
 * @}
 */

#endif /* LL_INTERRUPTS_SHARE_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
